Revit 2027 API
FilteredElementCollector.WherePasses Method
 Applies an element filter to the collector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilteredElementCollector WherePasses(
	ElementFilter filter
)
Public Function WherePasses (
	filter As ElementFilter
) As FilteredElementCollector
public:
FilteredElementCollector^ WherePasses(
	ElementFilter^ filter
)
member WherePasses :
        filter : ElementFilter -> FilteredElementCollector
Parameters
filter ElementFilter
 The element filter.
Return Value
FilteredElementCollector
 A handle to this collector. This is the same collector that has just been modified, returned so you can chain multiple calls together in one line.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The filter will be added as an additional condition that all filtered elements must pass. If you have an active iterator to this collector it will be stopped by this call.
See Also
Reference
FilteredElementCollector Class
Autodesk.Revit.DB Namespace